ItaySharon/cmsis-svd/data/Fujitsu/MB9AF1AxN.svd
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x44</addressOffset>
        <description>CSV status register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Sub clock failure detection flag</description>
            <name>SCMF</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Main clock failure detection flag </description>
            <name>MCMF</name>
          </field>
        </fields>
        <name>CSV_STR</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x48</addressOffset>
        <description>Frequency detection window setting register</description>
        <fields></fields>
        <name>FCSWH_CTL</name>
        <resetMask>0xFFFF</resetMask>
        <resetValue>0xFFFF</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4C</addressOffset>
        <description>Frequency detection window setting register</description>
        <fields></fields>
        <name>FCSWL_CTL</name>
        <resetMask>0xFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x50</addressOffset>
        <description>Frequency detection counter register</description>
        <fields></fields>
        <name>FCSWD_CTL</name>
        <resetMask>0xFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <access>read-write</access>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x1</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x4002E000</baseAddress>
    <description>CR Trimming Registers</description>
    <groupName>CRTRIM</groupName>
    <interrupts></interrupts>
    <name>CRTRIM</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>High-speed CR oscillation Frequency Division Setup Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>High-speed CR oscillation frequency division ratio setting bits</description>
            <name>CSR</name>
          </field>
        </fields>
        <name>MCR_PSR</name>
        <resetMask>0x7</resetMask>
        <resetValue>0x1</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x4</addressOffset>
        <description>High-speed CR oscillation Frequency Trimming Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0xA</bitWidth>
            <description>Frequency trimming setup bits</description>
            <name>TRD</name>
          </field>
        </fields>
        <name>MCR_FTRM</name>
        <resetMask>0x3FF</resetMask>
        <resetValue>0x180</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC</addressOffset>
        <description>High-Speed CR Oscillation Register Write-Protect Register </description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x20</bitWidth>
            <description>Register write-protect bits</description>
            <name>TRMLCK</name>
          </field>
        </fields>
        <name>MCR_RLR</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0x1</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <access>read-write</access>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x4</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40012000</baseAddress>
    <description>Software Watchdog Timer</description>
    <groupName>SWWDT</groupName>
    <interrupts>
      <interrupt>
        <name>SWDT</name>
        <value>0x1</value>
      </interrupt>
    </interrupts>
    <name>SWWDT</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>Software Watchdog Timer Load Register</description>
        <fields></fields>
        <name>WDOGLOAD</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0xFFFFFFFF</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x4</addressOffset>
        <description>Software Watchdog Timer Value Register</description>
        <fields></fields>
        <name>WDOGVALUE</name>
        <resetMask>0xFFFFFFFF</resetMask>
        <resetValue>0xFFFFFFFF</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x8</addressOffset>
        <description>Software Watchdog Timer Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Reset enable bit of the software watchdog</description>
            <name>RESEN</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt and counter enable bit of the software watchdog </description>
            <name>INTEN</name>
          </field>
        </fields>
        <name>WDOGCONTROL</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
