ItaySharon/cmsis-svd/data/Fujitsu/MB9AF1AxN.svd
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <alternateGroup>RT</alternateGroup>
        <description>PWM Cycle Set Register</description>
        <fields></fields>
        <name>RT_PCSR</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x8</addressOffset>
        <alternateGroup>RT</alternateGroup>
        <description>Timer Register</description>
        <fields></fields>
        <name>RT_TMR</name>
        <resetMask>0x0</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC</addressOffset>
        <alternateGroup>PWC</alternateGroup>
        <description>Timer Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xC</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Count clock selection bit </description>
            <name>CKS2_0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Measurement edge selection bits </description>
            <name>EGS</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>32-bit timer selection bit </description>
            <name>T32</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Timer function selection bits </description>
            <name>FMD</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Mode selection bit </description>
            <name>MDSE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Timer enable bit </description>
            <name>CTEN</name>
          </field>
        </fields>
        <name>PWC_TMCR</name>
        <resetMask>0x77F6</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x11</addressOffset>
        <alternateGroup>PWC</alternateGroup>
        <description>Timer Control Register 2</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Count clock selection bit</description>
            <name>CKS3</name>
          </field>
        </fields>
        <name>PWC_TMCR2</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x10</addressOffset>
        <alternateGroup>PWC</alternateGroup>
        <description>Status Control Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Error flag bit</description>
            <name>ERR</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Measurement completion interrupt request enable bit </description>
            <name>EDIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Overflow interrupt request enable bit </description>
            <name>OVIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Measurement completion interrupt request bit </description>
            <name>EDIR</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Overflow interrupt request bit </description>
            <name>OVIR</name>
          </field>
        </fields>
        <name>PWC_STC</name>
        <resetMask>0xD5</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x4</addressOffset>
        <alternateGroup>PWC</alternateGroup>
        <description>Data Buffer Register</description>
        <fields></fields>
        <name>PWC_DTBF</name>
        <resetMask>0xFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <resetMask>0x0</resetMask>
    <resetValue>0x0</resetValue>
    <size>0x20</size>
  </peripheral>
</peripherals>
<peripherals>
  <peripheral>
    <access>read-write</access>
    <addressBlock>
      <offset>0x0</offset>
      <size>0x2</size>
      <usage>registers</usage>
    </addressBlock>
    <baseAddress>0x40024000</baseAddress>
    <description>PPG Configuration</description>
    <groupName>MFT_PPG</groupName>
    <interrupts>
      <interrupt>
        <name>PPG</name>
        <value>0x16</value>
      </interrupt>
    </interrupts>
    <name>MFT_PPG</name>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <description>PPG Start Trigger Control Register 0</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xF</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>PPG6 trigger stop bit</description>
            <name>TRG6O</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xE</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>PPG4 trigger stop bit</description>
            <name>TRG4O</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xD</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>PPG2 trigger stop bit</description>
            <name>TRG2O</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xC</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>PPG0 trigger stop bit</description>
            <name>TRG0O</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xA</bitOffset>
            <bitWidth>0x2</bitWidth>
            <description>8-bit UP counter clock select bits for comparison</description>
            <name>CS0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x9</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>8-bit UP counter operation state monitor bit for comparison</description>
            <name>MONI0</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>8-bit UP counter operation enable bit for comparison</description>
            <name>STR0</name>
          </field>
        </fields>
        <name>TTCR0</name>
        <resetMask>0xFF00</resetMask>
        <resetValue>0xF000</resetValue>
        <size>0x10</size>
      </register>
