ItaySharon/cmsis-svd/data/Fujitsu/MB9AF1AxN.svd
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x50</addressOffset>
        <description>IRQ15 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Status interrupt request on MFS ch.4</description>
            <name>MFSINT1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmission interrupt request on MFS ch.4</description>
            <name>MFSINT0</name>
          </field>
        </fields>
        <name>IRQ15MON</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x54</addressOffset>
        <description>IRQ16 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Reception interrupt request on MFS ch.5</description>
            <name>MFSINT</name>
          </field>
        </fields>
        <name>IRQ16MON</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x58</addressOffset>
        <description>IRQ17 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Status interrupt request on MFS ch.5</description>
            <name>MFSINT1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmission interrupt request on MFS ch.5</description>
            <name>MFSINT0</name>
          </field>
        </fields>
        <name>IRQ17MON</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x5C</addressOffset>
        <description>IRQ18 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Reception interrupt request on MFS ch.6</description>
            <name>MFSINT</name>
          </field>
        </fields>
        <name>IRQ18MON</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x60</addressOffset>
        <description>IRQ19 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Status interrupt request on MFS ch.6</description>
            <name>MFSINT1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmission interrupt request on MFS ch.6</description>
            <name>MFSINT0</name>
          </field>
        </fields>
        <name>IRQ19MON</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x64</addressOffset>
        <description>IRQ20 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Reception interrupt request on MFS ch.7</description>
            <name>MFSINT</name>
          </field>
        </fields>
        <name>IRQ20MON</name>
        <resetMask>0x1</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x68</addressOffset>
        <description>IRQ21 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Status interrupt request on MFS ch.7</description>
            <name>MFSINT1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmission interrupt request on MFS ch.7</description>
            <name>MFSINT0</name>
          </field>
        </fields>
        <name>IRQ21MON</name>
        <resetMask>0x3</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x6C</addressOffset>
        <description>IRQ22 Batch Read Register</description>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt request on PPG ch.4 </description>
            <name>PPGINT2</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt request on PPG ch.2 </description>
            <name>PPGINT1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-only</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Interrupt request on PPG ch.0 </description>
            <name>PPGINT0</name>
          </field>
        </fields>
        <name>IRQ22MON</name>
        <resetMask>0x7</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x20</size>
      </register>
