ItaySharon/cmsis-svd/data/Fujitsu/MB9AF1AxN.svd
    </registers>
    <registers>
      <register>
        <access>read-only</access>
        <addressOffset>0x8</addressOffset>
        <alternateGroup>UART</alternateGroup>
        <description>Received Data Register</description>
        <fields></fields>
        <name>UART_RDR</name>
        <resetMask>0x1FF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>write-only</access>
        <addressOffset>0x8</addressOffset>
        <alternateGroup>UART</alternateGroup>
        <description>Transmit Data Register</description>
        <fields></fields>
        <name>UART_TDR</name>
        <resetMask>0x1FF</resetMask>
        <resetValue>0x1FF</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0xC</addressOffset>
        <alternateGroup>UART</alternateGroup>
        <description>Baud Rate Generator Registers</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0xF</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>External clock select bit</description>
            <name>EXT</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x8</bitOffset>
            <bitWidth>0x7</bitWidth>
            <description>Baud Rate Generator Registers 1</description>
            <name>BGR1</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x8</bitWidth>
            <description>Baud Rate Generator Registers 0</description>
            <name>BGR0</name>
          </field>
        </fields>
        <name>UART_BGR</name>
        <resetMask>0xFFFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x10</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x1</addressOffset>
        <alternateGroup>CSIO</alternateGroup>
        <description>Serial Control Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x7</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Programmable clear bit </description>
            <name>UPCL</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x6</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Master/Slave function select bit </description>
            <name>MS</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>SPI corresponding bit </description>
            <name>SPI</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Received interrupt enable bit </description>
            <name>RIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmit interrupt enable bit</description>
            <name>TIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transmit bus idle interrupt enable bit </description>
            <name>TBIE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Data received enable bit</description>
            <name>RXE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Data transmission enable bit </description>
            <name>TXE</name>
          </field>
        </fields>
        <name>CSIO_SCR</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
    </registers>
    <registers>
      <register>
        <access>read-write</access>
        <addressOffset>0x0</addressOffset>
        <alternateGroup>CSIO</alternateGroup>
        <description>Serial Mode Register</description>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x5</bitOffset>
            <bitWidth>0x3</bitWidth>
            <description>Operation mode set bits</description>
            <name>MD</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x4</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Wake-up control bit</description>
            <name>WUCR</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x3</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Serial clock invert bit </description>
            <name>SCINV</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x2</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Transfer direction select bit </description>
            <name>BDS</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x1</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Master mode serial clock output enable bit</description>
            <name>SCKE</name>
          </field>
        </fields>
        <fields>
          <field>
            <access>read-write</access>
            <bitOffset>0x0</bitOffset>
            <bitWidth>0x1</bitWidth>
            <description>Serial data output enable bit</description>
            <name>SOE</name>
          </field>
        </fields>
        <name>CSIO_SMR</name>
        <resetMask>0xFF</resetMask>
        <resetValue>0x0</resetValue>
        <size>0x8</size>
      </register>
